Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1402.h
/* -----------------------------  SCU_INTERRUPT_SRRAW  ---------------------------- */
#define SCU_INTERRUPT_SRRAW_PRWARN_Pos        (0UL)                     /*!< SCU_INTERRUPT SRRAW: PRWARN (Bit 0)                         */
#define SCU_INTERRUPT_SRRAW_PRWARN_Msk        (0x1UL)                   /*!< SCU_INTERRUPT SRRAW: PRWARN (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_PI_Pos            (1UL)                     /*!< SCU_INTERRUPT SRRAW: PI (Bit 1)                             */
#define SCU_INTERRUPT_SRRAW_PI_Msk            (0x2UL)                   /*!< SCU_INTERRUPT SRRAW: PI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRRAW_AI_Pos            (2UL)                     /*!< SCU_INTERRUPT SRRAW: AI (Bit 2)                             */
#define SCU_INTERRUPT_SRRAW_AI_Msk            (0x4UL)                   /*!< SCU_INTERRUPT SRRAW: AI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRRAW_VDDPI_Pos         (3UL)                     /*!< SCU_INTERRUPT SRRAW: VDDPI (Bit 3)                          */
#define SCU_INTERRUPT_SRRAW_VDDPI_Msk         (0x8UL)                   /*!< SCU_INTERRUPT SRRAW: VDDPI (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ACMP0I_Pos        (4UL)                     /*!< SCU_INTERRUPT SRRAW: ACMP0I (Bit 4)                         */
#define SCU_INTERRUPT_SRRAW_ACMP0I_Msk        (0x10UL)                  /*!< SCU_INTERRUPT SRRAW: ACMP0I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_ACMP1I_Pos        (5UL)                     /*!< SCU_INTERRUPT SRRAW: ACMP1I (Bit 5)                         */
#define SCU_INTERRUPT_SRRAW_ACMP1I_Msk        (0x20UL)                  /*!< SCU_INTERRUPT SRRAW: ACMP1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_ACMP2I_Pos        (6UL)                     /*!< SCU_INTERRUPT SRRAW: ACMP2I (Bit 6)                         */
#define SCU_INTERRUPT_SRRAW_ACMP2I_Msk        (0x40UL)                  /*!< SCU_INTERRUPT SRRAW: ACMP2I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_VDROPI_Pos        (7UL)                     /*!< SCU_INTERRUPT SRRAW: VDROPI (Bit 7)                         */
#define SCU_INTERRUPT_SRRAW_VDROPI_Msk        (0x80UL)                  /*!< SCU_INTERRUPT SRRAW: VDROPI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_ORC0I_Pos         (8UL)                     /*!< SCU_INTERRUPT SRRAW: ORC0I (Bit 8)                          */
#define SCU_INTERRUPT_SRRAW_ORC0I_Msk         (0x100UL)                 /*!< SCU_INTERRUPT SRRAW: ORC0I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC1I_Pos         (9UL)                     /*!< SCU_INTERRUPT SRRAW: ORC1I (Bit 9)                          */
#define SCU_INTERRUPT_SRRAW_ORC1I_Msk         (0x200UL)                 /*!< SCU_INTERRUPT SRRAW: ORC1I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC2I_Pos         (10UL)                    /*!< SCU_INTERRUPT SRRAW: ORC2I (Bit 10)                         */
#define SCU_INTERRUPT_SRRAW_ORC2I_Msk         (0x400UL)                 /*!< SCU_INTERRUPT SRRAW: ORC2I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC3I_Pos         (11UL)                    /*!< SCU_INTERRUPT SRRAW: ORC3I (Bit 11)                         */
#define SCU_INTERRUPT_SRRAW_ORC3I_Msk         (0x800UL)                 /*!< SCU_INTERRUPT SRRAW: ORC3I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC4I_Pos         (12UL)                    /*!< SCU_INTERRUPT SRRAW: ORC4I (Bit 12)                         */
#define SCU_INTERRUPT_SRRAW_ORC4I_Msk         (0x1000UL)                /*!< SCU_INTERRUPT SRRAW: ORC4I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC5I_Pos         (13UL)                    /*!< SCU_INTERRUPT SRRAW: ORC5I (Bit 13)                         */
#define SCU_INTERRUPT_SRRAW_ORC5I_Msk         (0x2000UL)                /*!< SCU_INTERRUPT SRRAW: ORC5I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC6I_Pos         (14UL)                    /*!< SCU_INTERRUPT SRRAW: ORC6I (Bit 14)                         */
#define SCU_INTERRUPT_SRRAW_ORC6I_Msk         (0x4000UL)                /*!< SCU_INTERRUPT SRRAW: ORC6I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_ORC7I_Pos         (15UL)                    /*!< SCU_INTERRUPT SRRAW: ORC7I (Bit 15)                         */
#define SCU_INTERRUPT_SRRAW_ORC7I_Msk         (0x8000UL)                /*!< SCU_INTERRUPT SRRAW: ORC7I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_LOCI_Pos          (16UL)                    /*!< SCU_INTERRUPT SRRAW: LOCI (Bit 16)                          */
#define SCU_INTERRUPT_SRRAW_LOCI_Msk          (0x10000UL)               /*!< SCU_INTERRUPT SRRAW: LOCI (Bitfield-Mask: 0x01)             */
#define SCU_INTERRUPT_SRRAW_PESRAMI_Pos       (17UL)                    /*!< SCU_INTERRUPT SRRAW: PESRAMI (Bit 17)                       */
#define SCU_INTERRUPT_SRRAW_PESRAMI_Msk       (0x20000UL)               /*!< SCU_INTERRUPT SRRAW: PESRAMI (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_PEU0I_Pos         (18UL)                    /*!< SCU_INTERRUPT SRRAW: PEU0I (Bit 18)                         */
#define SCU_INTERRUPT_SRRAW_PEU0I_Msk         (0x40000UL)               /*!< SCU_INTERRUPT SRRAW: PEU0I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRRAW_FLECC2I_Pos       (19UL)                    /*!< SCU_INTERRUPT SRRAW: FLECC2I (Bit 19)                       */
#define SCU_INTERRUPT_SRRAW_FLECC2I_Msk       (0x80000UL)               /*!< SCU_INTERRUPT SRRAW: FLECC2I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_FLCMPLTI_Pos      (20UL)                    /*!< SCU_INTERRUPT SRRAW: FLCMPLTI (Bit 20)                      */
#define SCU_INTERRUPT_SRRAW_FLCMPLTI_Msk      (0x100000UL)              /*!< SCU_INTERRUPT SRRAW: FLCMPLTI (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_VCLIPI_Pos        (21UL)                    /*!< SCU_INTERRUPT SRRAW: VCLIPI (Bit 21)                        */
#define SCU_INTERRUPT_SRRAW_VCLIPI_Msk        (0x200000UL)              /*!< SCU_INTERRUPT SRRAW: VCLIPI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW_SBYCLKFI_Pos      (22UL)                    /*!< SCU_INTERRUPT SRRAW: SBYCLKFI (Bit 22)                      */
#define SCU_INTERRUPT_SRRAW_SBYCLKFI_Msk      (0x400000UL)              /*!< SCU_INTERRUPT SRRAW: SBYCLKFI (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_RTC_CTR_Pos       (24UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_CTR (Bit 24)                       */
#define SCU_INTERRUPT_SRRAW_RTC_CTR_Msk       (0x1000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM0_Pos     (25UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_ATIM0 (Bit 25)                     */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM0_Msk     (0x2000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM1_Pos     (26UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_ATIM1 (Bit 26)                     */
#define SCU_INTERRUPT_SRRAW_RTC_ATIM1_Msk     (0x4000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRRAW_RTC_TIM0_Pos      (27UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_TIM0 (Bit 27)                      */
#define SCU_INTERRUPT_SRRAW_RTC_TIM0_Msk      (0x8000000UL)             /*!< SCU_INTERRUPT SRRAW: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_RTC_TIM1_Pos      (28UL)                    /*!< SCU_INTERRUPT SRRAW: RTC_TIM1 (Bit 28)                      */
#define SCU_INTERRUPT_SRRAW_RTC_TIM1_Msk      (0x10000000UL)            /*!< SCU_INTERRUPT SRRAW: RTC_TIM1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_TSE_DONE_Pos      (29UL)                    /*!< SCU_INTERRUPT SRRAW: TSE_DONE (Bit 29)                      */
#define SCU_INTERRUPT_SRRAW_TSE_DONE_Msk      (0x20000000UL)            /*!< SCU_INTERRUPT SRRAW: TSE_DONE (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_TSE_HIGH_Pos      (30UL)                    /*!< SCU_INTERRUPT SRRAW: TSE_HIGH (Bit 30)                      */
#define SCU_INTERRUPT_SRRAW_TSE_HIGH_Msk      (0x40000000UL)            /*!< SCU_INTERRUPT SRRAW: TSE_HIGH (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRRAW_TSE_LOW_Pos       (31UL)                    /*!< SCU_INTERRUPT SRRAW: TSE_LOW (Bit 31)                       */
#define SCU_INTERRUPT_SRRAW_TSE_LOW_Msk       (0x80000000UL)            /*!< SCU_INTERRUPT SRRAW: TSE_LOW (Bitfield-Mask: 0x01)          */

/* -----------------------------  SCU_INTERRUPT_SRMSK  ---------------------------- */
#define SCU_INTERRUPT_SRMSK_PRWARN_Pos        (0UL)                     /*!< SCU_INTERRUPT SRMSK: PRWARN (Bit 0)                         */
#define SCU_INTERRUPT_SRMSK_PRWARN_Msk        (0x1UL)                   /*!< SCU_INTERRUPT SRMSK: PRWARN (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_VDDPI_Pos         (3UL)                     /*!< SCU_INTERRUPT SRMSK: VDDPI (Bit 3)                          */
#define SCU_INTERRUPT_SRMSK_VDDPI_Msk         (0x8UL)                   /*!< SCU_INTERRUPT SRMSK: VDDPI (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ACMP0I_Pos        (4UL)                     /*!< SCU_INTERRUPT SRMSK: ACMP0I (Bit 4)                         */
#define SCU_INTERRUPT_SRMSK_ACMP0I_Msk        (0x10UL)                  /*!< SCU_INTERRUPT SRMSK: ACMP0I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_ACMP1I_Pos        (5UL)                     /*!< SCU_INTERRUPT SRMSK: ACMP1I (Bit 5)                         */
#define SCU_INTERRUPT_SRMSK_ACMP1I_Msk        (0x20UL)                  /*!< SCU_INTERRUPT SRMSK: ACMP1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_ACMP2I_Pos        (6UL)                     /*!< SCU_INTERRUPT SRMSK: ACMP2I (Bit 6)                         */
#define SCU_INTERRUPT_SRMSK_ACMP2I_Msk        (0x40UL)                  /*!< SCU_INTERRUPT SRMSK: ACMP2I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_VDROPI_Pos        (7UL)                     /*!< SCU_INTERRUPT SRMSK: VDROPI (Bit 7)                         */
#define SCU_INTERRUPT_SRMSK_VDROPI_Msk        (0x80UL)                  /*!< SCU_INTERRUPT SRMSK: VDROPI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_ORC0I_Pos         (8UL)                     /*!< SCU_INTERRUPT SRMSK: ORC0I (Bit 8)                          */
#define SCU_INTERRUPT_SRMSK_ORC0I_Msk         (0x100UL)                 /*!< SCU_INTERRUPT SRMSK: ORC0I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC1I_Pos         (9UL)                     /*!< SCU_INTERRUPT SRMSK: ORC1I (Bit 9)                          */
#define SCU_INTERRUPT_SRMSK_ORC1I_Msk         (0x200UL)                 /*!< SCU_INTERRUPT SRMSK: ORC1I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC2I_Pos         (10UL)                    /*!< SCU_INTERRUPT SRMSK: ORC2I (Bit 10)                         */
#define SCU_INTERRUPT_SRMSK_ORC2I_Msk         (0x400UL)                 /*!< SCU_INTERRUPT SRMSK: ORC2I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC3I_Pos         (11UL)                    /*!< SCU_INTERRUPT SRMSK: ORC3I (Bit 11)                         */
#define SCU_INTERRUPT_SRMSK_ORC3I_Msk         (0x800UL)                 /*!< SCU_INTERRUPT SRMSK: ORC3I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC4I_Pos         (12UL)                    /*!< SCU_INTERRUPT SRMSK: ORC4I (Bit 12)                         */
#define SCU_INTERRUPT_SRMSK_ORC4I_Msk         (0x1000UL)                /*!< SCU_INTERRUPT SRMSK: ORC4I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC5I_Pos         (13UL)                    /*!< SCU_INTERRUPT SRMSK: ORC5I (Bit 13)                         */
#define SCU_INTERRUPT_SRMSK_ORC5I_Msk         (0x2000UL)                /*!< SCU_INTERRUPT SRMSK: ORC5I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC6I_Pos         (14UL)                    /*!< SCU_INTERRUPT SRMSK: ORC6I (Bit 14)                         */
#define SCU_INTERRUPT_SRMSK_ORC6I_Msk         (0x4000UL)                /*!< SCU_INTERRUPT SRMSK: ORC6I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_ORC7I_Pos         (15UL)                    /*!< SCU_INTERRUPT SRMSK: ORC7I (Bit 15)                         */
#define SCU_INTERRUPT_SRMSK_ORC7I_Msk         (0x8000UL)                /*!< SCU_INTERRUPT SRMSK: ORC7I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_LOCI_Pos          (16UL)                    /*!< SCU_INTERRUPT SRMSK: LOCI (Bit 16)                          */
#define SCU_INTERRUPT_SRMSK_LOCI_Msk          (0x10000UL)               /*!< SCU_INTERRUPT SRMSK: LOCI (Bitfield-Mask: 0x01)             */
#define SCU_INTERRUPT_SRMSK_PESRAMI_Pos       (17UL)                    /*!< SCU_INTERRUPT SRMSK: PESRAMI (Bit 17)                       */
#define SCU_INTERRUPT_SRMSK_PESRAMI_Msk       (0x20000UL)               /*!< SCU_INTERRUPT SRMSK: PESRAMI (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_PEU0I_Pos         (18UL)                    /*!< SCU_INTERRUPT SRMSK: PEU0I (Bit 18)                         */
#define SCU_INTERRUPT_SRMSK_PEU0I_Msk         (0x40000UL)               /*!< SCU_INTERRUPT SRMSK: PEU0I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRMSK_FLECC2I_Pos       (19UL)                    /*!< SCU_INTERRUPT SRMSK: FLECC2I (Bit 19)                       */
#define SCU_INTERRUPT_SRMSK_FLECC2I_Msk       (0x80000UL)               /*!< SCU_INTERRUPT SRMSK: FLECC2I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_VCLIPI_Pos        (21UL)                    /*!< SCU_INTERRUPT SRMSK: VCLIPI (Bit 21)                        */
#define SCU_INTERRUPT_SRMSK_VCLIPI_Msk        (0x200000UL)              /*!< SCU_INTERRUPT SRMSK: VCLIPI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK_SBYCLKFI_Pos      (22UL)                    /*!< SCU_INTERRUPT SRMSK: SBYCLKFI (Bit 22)                      */
#define SCU_INTERRUPT_SRMSK_SBYCLKFI_Msk      (0x400000UL)              /*!< SCU_INTERRUPT SRMSK: SBYCLKFI (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_RTC_CTR_Pos       (24UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_CTR (Bit 24)                       */
#define SCU_INTERRUPT_SRMSK_RTC_CTR_Msk       (0x1000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM0_Pos     (25UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_ATIM0 (Bit 25)                     */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM0_Msk     (0x2000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM1_Pos     (26UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_ATIM1 (Bit 26)                     */
#define SCU_INTERRUPT_SRMSK_RTC_ATIM1_Msk     (0x4000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRMSK_RTC_TIM0_Pos      (27UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_TIM0 (Bit 27)                      */
#define SCU_INTERRUPT_SRMSK_RTC_TIM0_Msk      (0x8000000UL)             /*!< SCU_INTERRUPT SRMSK: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_RTC_TIM1_Pos      (28UL)                    /*!< SCU_INTERRUPT SRMSK: RTC_TIM1 (Bit 28)                      */
#define SCU_INTERRUPT_SRMSK_RTC_TIM1_Msk      (0x10000000UL)            /*!< SCU_INTERRUPT SRMSK: RTC_TIM1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_TSE_DONE_Pos      (29UL)                    /*!< SCU_INTERRUPT SRMSK: TSE_DONE (Bit 29)                      */
#define SCU_INTERRUPT_SRMSK_TSE_DONE_Msk      (0x20000000UL)            /*!< SCU_INTERRUPT SRMSK: TSE_DONE (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_TSE_HIGH_Pos      (30UL)                    /*!< SCU_INTERRUPT SRMSK: TSE_HIGH (Bit 30)                      */
#define SCU_INTERRUPT_SRMSK_TSE_HIGH_Msk      (0x40000000UL)            /*!< SCU_INTERRUPT SRMSK: TSE_HIGH (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRMSK_TSE_LOW_Pos       (31UL)                    /*!< SCU_INTERRUPT SRMSK: TSE_LOW (Bit 31)                       */
#define SCU_INTERRUPT_SRMSK_TSE_LOW_Msk       (0x80000000UL)            /*!< SCU_INTERRUPT SRMSK: TSE_LOW (Bitfield-Mask: 0x01)          */

