Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1402.h
/* ------------------------------  SCU_CLK_CGATSET0  ------------------------------ */
#define SCU_CLK_CGATSET0_VADC_Pos             (0UL)                     /*!< SCU_CLK CGATSET0: VADC (Bit 0)                              */
#define SCU_CLK_CGATSET0_VADC_Msk             (0x1UL)                   /*!< SCU_CLK CGATSET0: VADC (Bitfield-Mask: 0x01)                */
#define SCU_CLK_CGATSET0_CCU80_Pos            (1UL)                     /*!< SCU_CLK CGATSET0: CCU80 (Bit 1)                             */
#define SCU_CLK_CGATSET0_CCU80_Msk            (0x2UL)                   /*!< SCU_CLK CGATSET0: CCU80 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_CCU40_Pos            (2UL)                     /*!< SCU_CLK CGATSET0: CCU40 (Bit 2)                             */
#define SCU_CLK_CGATSET0_CCU40_Msk            (0x4UL)                   /*!< SCU_CLK CGATSET0: CCU40 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_USIC0_Pos            (3UL)                     /*!< SCU_CLK CGATSET0: USIC0 (Bit 3)                             */
#define SCU_CLK_CGATSET0_USIC0_Msk            (0x8UL)                   /*!< SCU_CLK CGATSET0: USIC0 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_BCCU0_Pos            (4UL)                     /*!< SCU_CLK CGATSET0: BCCU0 (Bit 4)                             */
#define SCU_CLK_CGATSET0_BCCU0_Msk            (0x10UL)                  /*!< SCU_CLK CGATSET0: BCCU0 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_LEDTS0_Pos           (5UL)                     /*!< SCU_CLK CGATSET0: LEDTS0 (Bit 5)                            */
#define SCU_CLK_CGATSET0_LEDTS0_Msk           (0x20UL)                  /*!< SCU_CLK CGATSET0: LEDTS0 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATSET0_LEDTS1_Pos           (6UL)                     /*!< SCU_CLK CGATSET0: LEDTS1 (Bit 6)                            */
#define SCU_CLK_CGATSET0_LEDTS1_Msk           (0x40UL)                  /*!< SCU_CLK CGATSET0: LEDTS1 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATSET0_POSIF0_Pos           (7UL)                     /*!< SCU_CLK CGATSET0: POSIF0 (Bit 7)                            */
#define SCU_CLK_CGATSET0_POSIF0_Msk           (0x80UL)                  /*!< SCU_CLK CGATSET0: POSIF0 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATSET0_MATH_Pos             (8UL)                     /*!< SCU_CLK CGATSET0: MATH (Bit 8)                              */
#define SCU_CLK_CGATSET0_MATH_Msk             (0x100UL)                 /*!< SCU_CLK CGATSET0: MATH (Bitfield-Mask: 0x01)                */
#define SCU_CLK_CGATSET0_WDT_Pos              (9UL)                     /*!< SCU_CLK CGATSET0: WDT (Bit 9)                               */
#define SCU_CLK_CGATSET0_WDT_Msk              (0x200UL)                 /*!< SCU_CLK CGATSET0: WDT (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_CGATSET0_RTC_Pos              (10UL)                    /*!< SCU_CLK CGATSET0: RTC (Bit 10)                              */
#define SCU_CLK_CGATSET0_RTC_Msk              (0x400UL)                 /*!< SCU_CLK CGATSET0: RTC (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_CGATSET0_CCU81_Pos            (16UL)                    /*!< SCU_CLK CGATSET0: CCU81 (Bit 16)                            */
#define SCU_CLK_CGATSET0_CCU81_Msk            (0x10000UL)               /*!< SCU_CLK CGATSET0: CCU81 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_CCU41_Pos            (17UL)                    /*!< SCU_CLK CGATSET0: CCU41 (Bit 17)                            */
#define SCU_CLK_CGATSET0_CCU41_Msk            (0x20000UL)               /*!< SCU_CLK CGATSET0: CCU41 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_USIC1_Pos            (18UL)                    /*!< SCU_CLK CGATSET0: USIC1 (Bit 18)                            */
#define SCU_CLK_CGATSET0_USIC1_Msk            (0x40000UL)               /*!< SCU_CLK CGATSET0: USIC1 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATSET0_LEDTS2_Pos           (19UL)                    /*!< SCU_CLK CGATSET0: LEDTS2 (Bit 19)                           */
#define SCU_CLK_CGATSET0_LEDTS2_Msk           (0x80000UL)               /*!< SCU_CLK CGATSET0: LEDTS2 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATSET0_POSIF1_Pos           (20UL)                    /*!< SCU_CLK CGATSET0: POSIF1 (Bit 20)                           */
#define SCU_CLK_CGATSET0_POSIF1_Msk           (0x100000UL)              /*!< SCU_CLK CGATSET0: POSIF1 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATSET0_MCAN0_Pos            (21UL)                    /*!< SCU_CLK CGATSET0: MCAN0 (Bit 21)                            */
#define SCU_CLK_CGATSET0_MCAN0_Msk            (0x200000UL)              /*!< SCU_CLK CGATSET0: MCAN0 (Bitfield-Mask: 0x01)               */

/* ------------------------------  SCU_CLK_CGATCLR0  ------------------------------ */
#define SCU_CLK_CGATCLR0_VADC_Pos             (0UL)                     /*!< SCU_CLK CGATCLR0: VADC (Bit 0)                              */
#define SCU_CLK_CGATCLR0_VADC_Msk             (0x1UL)                   /*!< SCU_CLK CGATCLR0: VADC (Bitfield-Mask: 0x01)                */
#define SCU_CLK_CGATCLR0_CCU80_Pos            (1UL)                     /*!< SCU_CLK CGATCLR0: CCU80 (Bit 1)                             */
#define SCU_CLK_CGATCLR0_CCU80_Msk            (0x2UL)                   /*!< SCU_CLK CGATCLR0: CCU80 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_CCU40_Pos            (2UL)                     /*!< SCU_CLK CGATCLR0: CCU40 (Bit 2)                             */
#define SCU_CLK_CGATCLR0_CCU40_Msk            (0x4UL)                   /*!< SCU_CLK CGATCLR0: CCU40 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_USIC0_Pos            (3UL)                     /*!< SCU_CLK CGATCLR0: USIC0 (Bit 3)                             */
#define SCU_CLK_CGATCLR0_USIC0_Msk            (0x8UL)                   /*!< SCU_CLK CGATCLR0: USIC0 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_BCCU0_Pos            (4UL)                     /*!< SCU_CLK CGATCLR0: BCCU0 (Bit 4)                             */
#define SCU_CLK_CGATCLR0_BCCU0_Msk            (0x10UL)                  /*!< SCU_CLK CGATCLR0: BCCU0 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_LEDTS0_Pos           (5UL)                     /*!< SCU_CLK CGATCLR0: LEDTS0 (Bit 5)                            */
#define SCU_CLK_CGATCLR0_LEDTS0_Msk           (0x20UL)                  /*!< SCU_CLK CGATCLR0: LEDTS0 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATCLR0_LEDTS1_Pos           (6UL)                     /*!< SCU_CLK CGATCLR0: LEDTS1 (Bit 6)                            */
#define SCU_CLK_CGATCLR0_LEDTS1_Msk           (0x40UL)                  /*!< SCU_CLK CGATCLR0: LEDTS1 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATCLR0_POSIF0_Pos           (7UL)                     /*!< SCU_CLK CGATCLR0: POSIF0 (Bit 7)                            */
#define SCU_CLK_CGATCLR0_POSIF0_Msk           (0x80UL)                  /*!< SCU_CLK CGATCLR0: POSIF0 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATCLR0_MATH_Pos             (8UL)                     /*!< SCU_CLK CGATCLR0: MATH (Bit 8)                              */
#define SCU_CLK_CGATCLR0_MATH_Msk             (0x100UL)                 /*!< SCU_CLK CGATCLR0: MATH (Bitfield-Mask: 0x01)                */
#define SCU_CLK_CGATCLR0_WDT_Pos              (9UL)                     /*!< SCU_CLK CGATCLR0: WDT (Bit 9)                               */
#define SCU_CLK_CGATCLR0_WDT_Msk              (0x200UL)                 /*!< SCU_CLK CGATCLR0: WDT (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_CGATCLR0_RTC_Pos              (10UL)                    /*!< SCU_CLK CGATCLR0: RTC (Bit 10)                              */
#define SCU_CLK_CGATCLR0_RTC_Msk              (0x400UL)                 /*!< SCU_CLK CGATCLR0: RTC (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_CGATCLR0_CCU81_Pos            (16UL)                    /*!< SCU_CLK CGATCLR0: CCU81 (Bit 16)                            */
#define SCU_CLK_CGATCLR0_CCU81_Msk            (0x10000UL)               /*!< SCU_CLK CGATCLR0: CCU81 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_CCU41_Pos            (17UL)                    /*!< SCU_CLK CGATCLR0: CCU41 (Bit 17)                            */
#define SCU_CLK_CGATCLR0_CCU41_Msk            (0x20000UL)               /*!< SCU_CLK CGATCLR0: CCU41 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_USIC1_Pos            (18UL)                    /*!< SCU_CLK CGATCLR0: USIC1 (Bit 18)                            */
#define SCU_CLK_CGATCLR0_USIC1_Msk            (0x40000UL)               /*!< SCU_CLK CGATCLR0: USIC1 (Bitfield-Mask: 0x01)               */
#define SCU_CLK_CGATCLR0_LEDTS2_Pos           (19UL)                    /*!< SCU_CLK CGATCLR0: LEDTS2 (Bit 19)                           */
#define SCU_CLK_CGATCLR0_LEDTS2_Msk           (0x80000UL)               /*!< SCU_CLK CGATCLR0: LEDTS2 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATCLR0_POSIF1_Pos           (20UL)                    /*!< SCU_CLK CGATCLR0: POSIF1 (Bit 20)                           */
#define SCU_CLK_CGATCLR0_POSIF1_Msk           (0x100000UL)              /*!< SCU_CLK CGATCLR0: POSIF1 (Bitfield-Mask: 0x01)              */
#define SCU_CLK_CGATCLR0_MCAN0_Pos            (21UL)                    /*!< SCU_CLK CGATCLR0: MCAN0 (Bit 21)                            */
#define SCU_CLK_CGATCLR0_MCAN0_Msk            (0x200000UL)              /*!< SCU_CLK CGATCLR0: MCAN0 (Bitfield-Mask: 0x01)               */

